[tasks]
bmc
cover

[options]
bmc: mode bmc
cover: mode cover
cover: depth 40

[engines]
smtbmc boolector

[script]
read_verilog -formal -DFORMAL_SVC_ARBITER -sv svc_arbiter.sv
chparam -set NUM_M 6 svc_arbiter
prep -top svc_arbiter

[files]
rtl/
